## Plan for terraform
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                             NAME                              |
|----------|---------------------------------------------------------------|
| recreate | `aws_lambda_layer_version.lambda_layer`                       |
|          | `aws_lambda_layer_version_permission.lambda_layer_permission` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_layer_version.lambda_layer must be replaced
-/+ resource "aws_lambda_layer_version" "lambda_layer" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:67" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-05-29T13:11:06.277+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:67" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "8o8J8UfnMOi8e1wCwAj+zxMaGgtUkrsqJdT/GfNGcZw=" -> "C3Vd8Gu9U2IrIelDPAbJhZat6DbtJSk5AxeozmFkkVA=" # forces replacement
      ~ source_code_size            = 13439054 -> (known after apply)
      ~ version                     = "67" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version_permission.lambda_layer_permission must be replaced
-/+ resource "aws_lambda_layer_version_permission" "lambda_layer_permission" {
      ~ id             = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer,67" -> (known after apply)
      ~ layer_name     = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer" -> (known after apply) # forces replacement
      ~ policy         = jsonencode(
            {
              - Id        = "default"
              - Statement = [
                  - {
                      - Action    = "lambda:GetLayerVersion"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:67"
                      - Sid       = "shared-layer-permission"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ revision_id    = "b2bfb77e-7c46-49a8-b73c-ea07f2db4ea6" -> (known after apply)
      + skip_destroy   = false # forces replacement
      ~ version_number = 67 -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
